zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131dxx_ca7.h
/*!< AVD level configuration */
#define PWR_CR1_ALS_LEV0               ((uint32_t)0x00000000)                  /*!< AVD level 0 */
#define PWR_CR1_ALS_LEV1_Pos           (17U)
#define PWR_CR1_ALS_LEV1_Msk           (0x1UL << PWR_CR1_ALS_LEV1_Pos)          /*!< 0x00020000 */
#define PWR_CR1_ALS_LEV1               PWR_CR1_ALS_LEV1_Msk                    /*!< AVD level 1 */
#define PWR_CR1_ALS_LEV2_Pos           (18U)
#define PWR_CR1_ALS_LEV2_Msk           (0x1UL << PWR_CR1_ALS_LEV2_Pos)          /*!< 0x00040000 */
#define PWR_CR1_ALS_LEV2               PWR_CR1_ALS_LEV2_Msk                    /*!< AVD level 2 */
#define PWR_CR1_ALS_LEV3_Pos           (17U)
#define PWR_CR1_ALS_LEV3_Msk           (0x3UL << PWR_CR1_ALS_LEV3_Pos)          /*!< 0x00060000 */
#define PWR_CR1_ALS_LEV3               PWR_CR1_ALS_LEV3_Msk                    /*!< AVD level 3 */

/*!< PVD level configuration */
#define PWR_CR1_PLS_LEV0               ((uint32_t)0x00000000)                  /*!< PVD level 0 */
#define PWR_CR1_PLS_LEV1_Pos           (5U)
#define PWR_CR1_PLS_LEV1_Msk           (0x1UL << PWR_CR1_PLS_LEV1_Pos)          /*!< 0x00000020 */
#define PWR_CR1_PLS_LEV1               PWR_CR1_PLS_LEV1_Msk                    /*!< PVD level 1 */
#define PWR_CR1_PLS_LEV2_Pos           (6U)
#define PWR_CR1_PLS_LEV2_Msk           (0x1UL << PWR_CR1_PLS_LEV2_Pos)          /*!< 0x00000040 */
#define PWR_CR1_PLS_LEV2               PWR_CR1_PLS_LEV2_Msk                    /*!< PVD level 2 */
#define PWR_CR1_PLS_LEV3_Pos           (5U)
#define PWR_CR1_PLS_LEV3_Msk           (0x3UL << PWR_CR1_PLS_LEV3_Pos)          /*!< 0x00000060 */
#define PWR_CR1_PLS_LEV3               PWR_CR1_PLS_LEV3_Msk                    /*!< PVD level 3 */
#define PWR_CR1_PLS_LEV4_Pos           (7U)
#define PWR_CR1_PLS_LEV4_Msk           (0x1UL << PWR_CR1_PLS_LEV4_Pos)          /*!< 0x00000080 */
#define PWR_CR1_PLS_LEV4               PWR_CR1_PLS_LEV4_Msk                    /*!< PVD level 4 */
#define PWR_CR1_PLS_LEV5_Pos           (5U)
#define PWR_CR1_PLS_LEV5_Msk           (0x5UL << PWR_CR1_PLS_LEV5_Pos)          /*!< 0x000000A0 */
#define PWR_CR1_PLS_LEV5               PWR_CR1_PLS_LEV5_Msk                    /*!< PVD level 5 */
#define PWR_CR1_PLS_LEV6_Pos           (6U)
#define PWR_CR1_PLS_LEV6_Msk           (0x3UL << PWR_CR1_PLS_LEV6_Pos)          /*!< 0x000000C0 */
#define PWR_CR1_PLS_LEV6               PWR_CR1_PLS_LEV6_Msk                    /*!< PVD level 6 */
#define PWR_CR1_PLS_LEV7_Pos           (5U)
#define PWR_CR1_PLS_LEV7_Msk           (0x7UL << PWR_CR1_PLS_LEV7_Pos)          /*!< 0x000000E0 */
#define PWR_CR1_PLS_LEV7               PWR_CR1_PLS_LEV7_Msk                    /*!< PVD level 7 */

/********************  Bit definition for PWR_CSR1 register  ********************/
#define PWR_CSR1_AVDO_Pos              (16U)
#define PWR_CSR1_AVDO_Msk              (0x1UL << PWR_CSR1_AVDO_Pos)             /*!< 0x00010000 */
#define PWR_CSR1_AVDO                  PWR_CSR1_AVDO_Msk                       /*!< Analog Voltage detector Output on VDDA */
#define PWR_CSR1_PVDO_Pos              (4U)
#define PWR_CSR1_PVDO_Msk              (0x1UL << PWR_CSR1_PVDO_Pos)             /*!< 0x00000010 */
#define PWR_CSR1_PVDO                  PWR_CSR1_PVDO_Msk                       /*!< Programmable Voltage Detect Output */

/********************  Bit definition for PWR_CR2 register  ********************/
#define PWR_CR2_BREN_Pos        (0U)
#define PWR_CR2_BREN_Msk        (0x1UL << PWR_CR2_BREN_Pos)                     /*!< 0x00000001 */
#define PWR_CR2_BREN            PWR_CR2_BREN_Msk                               /*!< Backup regulator enable */
#define PWR_CR2_MONEN_Pos       (4U)
#define PWR_CR2_MONEN_Msk       (0x1UL << PWR_CR2_MONEN_Pos)                    /*!< 0x00000010 */
#define PWR_CR2_MONEN           PWR_CR2_MONEN_Msk                              /*!< VBAT and temperature monitoring enable */
#define PWR_CR2_BRRDY_Pos       (16U)
#define PWR_CR2_BRRDY_Msk       (0x1UL << PWR_CR2_BRRDY_Pos)                    /*!< 0x00010000 */
#define PWR_CR2_BRRDY           PWR_CR2_BRRDY_Msk                              /*!< Backup Regulator ready */
#define PWR_CR2_VBATL_Pos       (20U)
#define PWR_CR2_VBATL_Msk       (0x1UL << PWR_CR2_VBATL_Pos)                    /*!< 0x00100000 */
#define PWR_CR2_VBATL           PWR_CR2_VBATL_Msk                              /*!< Monitored VBAT level equal or below low threshold */
#define PWR_CR2_VBATH_Pos       (21U)
#define PWR_CR2_VBATH_Msk       (0x1UL << PWR_CR2_VBATH_Pos)                    /*!< 0x00200000 */
#define PWR_CR2_VBATH           PWR_CR2_VBATH_Msk                              /*!< Monitored VBAT level equal or above high threshold */
#define PWR_CR2_TEMPL_Pos       (22U)
#define PWR_CR2_TEMPL_Msk       (0x1UL << PWR_CR2_TEMPL_Pos)                    /*!< 0x00300000 */
#define PWR_CR2_TEMPL           PWR_CR2_TEMPL_Msk                              /*!< Monitored temperature level equal or below low threshold */
#define PWR_CR2_TEMPH_Pos       (23U)
#define PWR_CR2_TEMPH_Msk       (0x1UL << PWR_CR2_TEMPH_Pos)                    /*!< 0x00400000 */
#define PWR_CR2_TEMPH           PWR_CR2_TEMPH_Msk                              /*!< Monitored temperature level equal or below high threshold */

/********************  Bit definition for PWR_CR3 register  ********************/
#define PWR_CR3_VBE_Pos               (8U)
#define PWR_CR3_VBE_Msk               (0x1UL << PWR_CR3_VBE_Pos)                /*!< 0x00000100 */
#define PWR_CR3_VBE                   PWR_CR3_VBE_Msk                          /*!< VBAT charging enable */
#define PWR_CR3_VBRS_Pos              (9U)
#define PWR_CR3_VBRS_Msk              (0x1UL << PWR_CR3_VBRS_Pos)               /*!< 0x00000200 */
#define PWR_CR3_VBRS                  PWR_CR3_VBRS_Msk                         /*!< VBAT charging resistor selection */
#define PWR_CR3_DDRSREN_Pos           (10U)
#define PWR_CR3_DDRSREN_Msk           (0x1UL << PWR_CR3_DDRSREN_Pos)            /*!< 0x00000400 */
#define PWR_CR3_DDRSREN               PWR_CR3_DDRSREN_Msk                      /*!< DDR self-refresh in standby mode enable */
#define PWR_CR3_DDRSRDIS_Pos          (11U)
#define PWR_CR3_DDRSRDIS_Msk          (0x1UL << PWR_CR3_DDRSRDIS_Pos)           /*!< 0x00000800 */
#define PWR_CR3_DDRSRDIS              PWR_CR3_DDRSRDIS_Msk                     /*!< DDR self-refresh retention after standby disable */
#define PWR_CR3_DDRRETEN_Pos          (12U)
#define PWR_CR3_DDRRETEN_Msk          (0x1UL << PWR_CR3_DDRRETEN_Pos)           /*!< 0x00001000 */
#define PWR_CR3_DDRRETEN              PWR_CR3_DDRRETEN_Msk                     /*!< DDR retention enable */
#define PWR_CR3_VDDSD1DEN_Pos         (13U)
#define PWR_CR3_VDDSD1DEN_Msk         (0x1UL << PWR_CR3_VDDSD1DEN_Pos)          /*!< 0x00001000 */
#define PWR_CR3_VDDSD1DEN             PWR_CR3_VDDSD1DEN_Msk                    /*!< SD1 IOs enable */
#define PWR_CR3_VDDSD1RDY_Pos         (14U)
#define PWR_CR3_VDDSD1RDY_Msk         (0x1UL << PWR_CR3_VDDSD1RDY_Pos)          /*!< 0x00001000 */
#define PWR_CR3_VDDSD1RDY             PWR_CR3_VDDSD1RDY_Msk                    /*!< SD2 IOs ready */
#define PWR_CR3_VDDSD2DEN_Pos         (15U)
#define PWR_CR3_VDDSD2DEN_Msk         (0x1UL << PWR_CR3_VDDSD2DEN_Pos)          /*!< 0x00001000 */
#define PWR_CR3_VDDSD2DEN             PWR_CR3_VDDSD2DEN_Msk                    /*!< SD2 IOs enable */
#define PWR_CR3_VDDSD2RDY_Pos         (16U)
#define PWR_CR3_VDDSD2RDY_Msk         (0x1UL << PWR_CR3_VDDSD2RDY_Pos)          /*!< 0x00001000 */
#define PWR_CR3_VDDSD2RDY             PWR_CR3_VDDSD2RDY_Msk                    /*!< SD2 IOs ready */
#define PWR_CR3_POPL_Pos              (17U)
#define PWR_CR3_POPL_Msk              (0x1FUL << PWR_CR3_POPL_Pos)              /*!< 0x003E0000 */
#define PWR_CR3_POPL                  PWR_CR3_POPL_Msk                         /*!< PWR_ON pulse low configuration */
#define PWR_CR3_VDDSD1VALID_Pos       (22U)
#define PWR_CR3_VDDSD1VALID_Msk       (0x1UL << PWR_CR3_VDDSD1VALID_Pos)        /*!< 0x00400000 */
#define PWR_CR3_VDDSD1VALID           PWR_CR3_VDDSD1VALID_Msk                  /*!< SD1 IOs override enable */
#define PWR_CR3_VDDSD2VALID_Pos       (23U)
#define PWR_CR3_VDDSD2VALID_Msk       (0x1UL << PWR_CR3_VDDSD2VALID_Pos)        /*!< 0x00800000 */
#define PWR_CR3_VDDSD2VALID           PWR_CR3_VDDSD2VALID_Msk                  /*!< SD2 IOs override enable */
#define PWR_CR3_USB33DEN_Pos          (24U)
#define PWR_CR3_USB33DEN_Msk          (0x1UL << PWR_CR3_USB33DEN_Pos)           /*!< 0x01000000 */
#define PWR_CR3_USB33DEN              PWR_CR3_USB33DEN_Msk                     /*!< USB33DEN: USB 3.3V voltage level detector enable */
#define PWR_CR3_USB33RDY_Pos          (26U)
#define PWR_CR3_USB33RDY_Msk          (0x1UL << PWR_CR3_USB33RDY_Pos)           /*!< 0x04000000 */
#define PWR_CR3_USB33RDY              PWR_CR3_USB33RDY_Msk                     /*!< USB 3.3V supply ready */
#define PWR_CR3_REG18EN_Pos           (28U)
#define PWR_CR3_REG18EN_Msk           (0x1UL << PWR_CR3_REG18EN_Pos)            /*!< 0x10000000 */
#define PWR_CR3_REG18EN               PWR_CR3_REG18EN_Msk                      /*!< 1V8 regulator enable */
#define PWR_CR3_REG18RDY_Pos          (29U)
#define PWR_CR3_REG18RDY_Msk          (0x1UL << PWR_CR3_REG18RDY_Pos)           /*!< 0x20000000 */
#define PWR_CR3_REG18RDY              PWR_CR3_REG18RDY_Msk                     /*!< 1V8 regulator supply ready */
#define PWR_CR3_REG11EN_Pos           (30U)
#define PWR_CR3_REG11EN_Msk           (0x1UL << PWR_CR3_REG11EN_Pos)            /*!< 0x40000000 */
#define PWR_CR3_REG11EN               PWR_CR3_REG11EN_Msk                      /*!< 1V1 regulator enable  */
#define PWR_CR3_REG11RDY_Pos          (31U)
#define PWR_CR3_REG11RDY_Msk          (0x1UL << PWR_CR3_REG11RDY_Pos)           /*!< 0x80000000 */
#define PWR_CR3_REG11RDY              PWR_CR3_REG11RDY_Msk                     /*!< 1V1 regulator supply ready */

/********************  Bit definition for PWR_MPUCR register  ********************/
#define PWR_MPUCR_PDDS_Pos            (0U)
#define PWR_MPUCR_PDDS_Msk            (0x1UL << PWR_MPUCR_PDDS_Pos)             /*!< 0x00000001 */
#define PWR_MPUCR_PDDS                PWR_MPUCR_PDDS_Msk                       /*!< System Power Down Deepsleep selection */
#define PWR_MPUCR_STOPF_Pos           (5U)
#define PWR_MPUCR_STOPF_Msk           (0x1UL << PWR_MPUCR_STOPF_Pos)            /*!< 0x00000020 */
#define PWR_MPUCR_STOPF               PWR_MPUCR_STOPF_Msk                      /*!< Stop Flag */
#define PWR_MPUCR_SBF_Pos             (6U)
#define PWR_MPUCR_SBF_Msk             (0x1UL << PWR_MPUCR_SBF_Pos)              /*!< 0x00000040 */
#define PWR_MPUCR_SBF                 PWR_MPUCR_SBF_Msk                        /*!< System Standby Flag */
#define PWR_MPUCR_SBF_MPU_Pos         (7U)
#define PWR_MPUCR_SBF_MPU_Msk         (0x1UL << PWR_MPUCR_SBF_MPU_Pos)          /*!< 0x00000080 */
#define PWR_MPUCR_SBF_MPU             PWR_MPUCR_SBF_MPU_Msk                    /*!< MPU Standby Flag */
#define PWR_MPUCR_CSSF_Pos            (9U)
#define PWR_MPUCR_CSSF_Msk            (0x1UL << PWR_MPUCR_CSSF_Pos)             /*!< 0x00000200 */
#define PWR_MPUCR_CSSF                PWR_MPUCR_CSSF_Msk                       /*!< Clear MCU STANDBY, STOP and HOLD flags.(always read as 0) */
#define PWR_MPUCR_STANDBYWFIL2_Pos    (15U)
#define PWR_MPUCR_STANDBYWFIL2_Msk    (0x1UL << PWR_MPUCR_STANDBYWFIL2_Pos)     /*!< 0x00008000 */
#define PWR_MPUCR_STANDBYWFIL2        PWR_MPUCR_STANDBYWFIL2_Msk               /*!< MPU system idle indication */

/********************  Bit definition for PWR_WKUPCR register  ********************/
#define PWR_WKUPCR_WKUPPUPD_Pos        (16U)
#define PWR_WKUPCR_WKUPPUPD_Msk        (0xFFFUL << PWR_WKUPCR_WKUPPUPD_Pos)     /*!< 0x0FFF0000 */
#define PWR_WKUPCR_WKUPPUPD            PWR_WKUPCR_WKUPPUPD_Msk                 /*!< Wakeup Pin pull configuration mask*/
#define PWR_WKUPCR_WKUPPUPD6_Pos       (26U)
#define PWR_WKUPCR_WKUPPUPD6_Msk       (0x3UL << PWR_WKUPCR_WKUPPUPD6_Pos)      /*!< 0x0C000000 */
#define PWR_WKUPCR_WKUPPUPD6           PWR_WKUPCR_WKUPPUPD6_Msk                /*!< Wakeup Pin pull configuration for WKUP6 */
#define PWR_WKUPCR_WKUPPUPD6_0         (0x1UL << PWR_WKUPCR_WKUPPUPD6_Pos)      /*!< 0x04000000 */
#define PWR_WKUPCR_WKUPPUPD6_1         (0x2UL << PWR_WKUPCR_WKUPPUPD6_Pos)      /*!< 0x08000000 */
#define PWR_WKUPCR_WKUPPUPD5_Pos       (24U)
#define PWR_WKUPCR_WKUPPUPD5_Msk       (0x3UL << PWR_WKUPCR_WKUPPUPD5_Pos)      /*!< 0x03000000 */
#define PWR_WKUPCR_WKUPPUPD5           PWR_WKUPCR_WKUPPUPD5_Msk                /*!< Wakeup Pin pull configuration for WKUP5 */
#define PWR_WKUPCR_WKUPPUPD5_0         (0x1UL << PWR_WKUPCR_WKUPPUPD5_Pos)      /*!< 0x01000000 */
#define PWR_WKUPCR_WKUPPUPD5_1         (0x2UL << PWR_WKUPCR_WKUPPUPD5_Pos)      /*!< 0x02000000 */
#define PWR_WKUPCR_WKUPPUPD4_Pos       (22U)
#define PWR_WKUPCR_WKUPPUPD4_Msk       (0x3UL << PWR_WKUPCR_WKUPPUPD4_Pos)      /*!< 0x00C00000 */
#define PWR_WKUPCR_WKUPPUPD4           PWR_WKUPCR_WKUPPUPD4_Msk                /*!< Wakeup Pin pull configuration for WKUP4 */
#define PWR_WKUPCR_WKUPPUPD4_0         (0x1UL << PWR_WKUPCR_WKUPPUPD4_Pos)      /*!< 0x00400000 */
#define PWR_WKUPCR_WKUPPUPD4_1         (0x2UL << PWR_WKUPCR_WKUPPUPD4_Pos)      /*!< 0x00800000 */
#define PWR_WKUPCR_WKUPPUPD3_Pos       (20U)
#define PWR_WKUPCR_WKUPPUPD3_Msk       (0x3UL << PWR_WKUPCR_WKUPPUPD3_Pos)      /*!< 0x00300000 */
#define PWR_WKUPCR_WKUPPUPD3           PWR_WKUPCR_WKUPPUPD3_Msk                /*!< Wakeup Pin pull configuration for WKUP3 */
#define PWR_WKUPCR_WKUPPUPD3_0         (0x1UL << PWR_WKUPCR_WKUPPUPD3_Pos)      /*!< 0x00100000 */
#define PWR_WKUPCR_WKUPPUPD3_1         (0x2UL << PWR_WKUPCR_WKUPPUPD3_Pos)      /*!< 0x00200000 */
#define PWR_WKUPCR_WKUPPUPD2_Pos       (18U)
#define PWR_WKUPCR_WKUPPUPD2_Msk       (0x3UL << PWR_WKUPCR_WKUPPUPD2_Pos)      /*!< 0x000C0000 */
#define PWR_WKUPCR_WKUPPUPD2           PWR_WKUPCR_WKUPPUPD2_Msk                /*!< Wakeup Pin pull configuration for WKUP2 */
#define PWR_WKUPCR_WKUPPUPD2_0         (0x1UL << PWR_WKUPCR_WKUPPUPD2_Pos)      /*!< 0x00040000 */
#define PWR_WKUPCR_WKUPPUPD2_1         (0x2UL << PWR_WKUPCR_WKUPPUPD2_Pos)      /*!< 0x00080000 */
#define PWR_WKUPCR_WKUPPUPD1_Pos       (16U)
#define PWR_WKUPCR_WKUPPUPD1_Msk       (0x3UL << PWR_WKUPCR_WKUPPUPD1_Pos)      /*!< 0x00030000 */
#define PWR_WKUPCR_WKUPPUPD1           PWR_WKUPCR_WKUPPUPD1_Msk                /*!< Wakeup Pin pull configuration for WKUP1 */
#define PWR_WKUPCR_WKUPPUPD1_0         (0x1UL << PWR_WKUPCR_WKUPPUPD1_Pos)      /*!< 0x00010000 */
#define PWR_WKUPCR_WKUPPUPD1_1         (0x2UL << PWR_WKUPCR_WKUPPUPD1_Pos)      /*!< 0x00020000 */

#define PWR_WKUPCR_WKUPP_Pos           (8U)
#define PWR_WKUPCR_WKUPP_Msk           (0x3FUL << PWR_WKUPCR_WKUPP_Pos)         /*!< 0x00003F00 */
#define PWR_WKUPCR_WKUPP               PWR_WKUPCR_WKUPP_Msk                    /*!< Wakeup Pin Polarity mask*/
#define PWR_WKUPCR_WKUPP_6             (0x20UL << PWR_WKUPCR_WKUPP_Pos)         /*!< 0x00002000 */
#define PWR_WKUPCR_WKUPP_5             (0x10UL << PWR_WKUPCR_WKUPP_Pos)         /*!< 0x00001000 */
#define PWR_WKUPCR_WKUPP_4             (0x08UL << PWR_WKUPCR_WKUPP_Pos)         /*!< 0x00000800 */
#define PWR_WKUPCR_WKUPP_3             (0x04UL << PWR_WKUPCR_WKUPP_Pos)         /*!< 0x00000400 */
#define PWR_WKUPCR_WKUPP_2             (0x02UL << PWR_WKUPCR_WKUPP_Pos)         /*!< 0x00000200 */
#define PWR_WKUPCR_WKUPP_1             (0x01UL << PWR_WKUPCR_WKUPP_Pos)         /*!< 0x00000100 */

#define PWR_WKUPCR_WKUPC_Pos           (0U)
#define PWR_WKUPCR_WKUPC_Msk           (0x3FUL << PWR_WKUPCR_WKUPC_Pos)         /*!< 0x0000003F */
#define PWR_WKUPCR_WKUPC               PWR_WKUPCR_WKUPC_Msk                    /*!< Wakeup Pin Mask */
#define PWR_WKUPCR_WKUPC6_Pos          (5U)
#define PWR_WKUPCR_WKUPC6_Msk          (0x1UL << PWR_WKUPCR_WKUPC6_Pos)         /*!< 0x00000020 */
#define PWR_WKUPCR_WKUPC6              PWR_WKUPCR_WKUPC6_Msk                   /*!< Clear Wakeup Pin Flag 6 */
#define PWR_WKUPCR_WKUPC5_Pos          (4U)
#define PWR_WKUPCR_WKUPC5_Msk          (0x1UL << PWR_WKUPCR_WKUPC5_Pos)         /*!< 0x00000010 */
#define PWR_WKUPCR_WKUPC5              PWR_WKUPCR_WKUPC5_Msk                   /*!< Clear Wakeup Pin Flag 5 */
#define PWR_WKUPCR_WKUPC4_Pos          (3U)
#define PWR_WKUPCR_WKUPC4_Msk          (0x1UL << PWR_WKUPCR_WKUPC4_Pos)         /*!< 0x00000008 */
#define PWR_WKUPCR_WKUPC4              PWR_WKUPCR_WKUPC4_Msk                   /*!< Clear Wakeup Pin Flag 4 */
#define PWR_WKUPCR_WKUPC3_Pos          (2U)
#define PWR_WKUPCR_WKUPC3_Msk          (0x1UL << PWR_WKUPCR_WKUPC3_Pos)         /*!< 0x00000004 */
#define PWR_WKUPCR_WKUPC3              PWR_WKUPCR_WKUPC3_Msk                   /*!< Clear Wakeup Pin Flag 3 */
#define PWR_WKUPCR_WKUPC2_Pos          (1U)
#define PWR_WKUPCR_WKUPC2_Msk          (0x1UL << PWR_WKUPCR_WKUPC2_Pos)         /*!< 0x00000002 */
#define PWR_WKUPCR_WKUPC2              PWR_WKUPCR_WKUPC2_Msk                   /*!< Clear Wakeup Pin Flag 2 */
#define PWR_WKUPCR_WKUPC1_Pos          (0U)
#define PWR_WKUPCR_WKUPC1_Msk          (0x1UL << PWR_WKUPCR_WKUPC1_Pos)         /*!< 0x00000001 */
#define PWR_WKUPCR_WKUPC1              PWR_WKUPCR_WKUPC1_Msk                   /*!< Clear Wakeup Pin Flag 1 */

/********************  Bit definition for PWR_WKUPFR register  ********************/
#define PWR_WKUPFR_WKUPF6_Pos          (5U)
#define PWR_WKUPFR_WKUPF6_Msk          (0x1UL << PWR_WKUPFR_WKUPF6_Pos)         /*!< 0x00000020 */
#define PWR_WKUPFR_WKUPF6              PWR_WKUPFR_WKUPF6_Msk                   /*!< Wakeup Pin Flag 6 */
#define PWR_WKUPFR_WKUPF5_Pos          (4U)
#define PWR_WKUPFR_WKUPF5_Msk          (0x1UL << PWR_WKUPFR_WKUPF5_Pos)         /*!< 0x00000010 */
#define PWR_WKUPFR_WKUPF5              PWR_WKUPFR_WKUPF5_Msk                   /*!< Wakeup Pin Flag 5 */
#define PWR_WKUPFR_WKUPF4_Pos          (3U)
#define PWR_WKUPFR_WKUPF4_Msk          (0x1UL << PWR_WKUPFR_WKUPF4_Pos)         /*!< 0x00000008 */
#define PWR_WKUPFR_WKUPF4              PWR_WKUPFR_WKUPF4_Msk                   /*!< Wakeup Pin Flag 4 */
#define PWR_WKUPFR_WKUPF3_Pos          (2U)
#define PWR_WKUPFR_WKUPF3_Msk          (0x1UL << PWR_WKUPFR_WKUPF3_Pos)         /*!< 0x00000004 */
#define PWR_WKUPFR_WKUPF3              PWR_WKUPFR_WKUPF3_Msk                   /*!< Wakeup Pin Flag 3 */
#define PWR_WKUPFR_WKUPF2_Pos          (1U)
#define PWR_WKUPFR_WKUPF2_Msk          (0x1UL << PWR_WKUPFR_WKUPF2_Pos)         /*!< 0x00000002 */
#define PWR_WKUPFR_WKUPF2              PWR_WKUPFR_WKUPF2_Msk                   /*!< Wakeup Pin Flag 2 */
#define PWR_WKUPFR_WKUPF1_Pos          (0U)
#define PWR_WKUPFR_WKUPF1_Msk          (0x1UL << PWR_WKUPFR_WKUPF1_Pos)         /*!< 0x00000001 */
#define PWR_WKUPFR_WKUPF1              PWR_WKUPFR_WKUPF1_Msk                   /*!< Wakeup Pin Flag 1 */

/********************  Bit definition for PWR_MPUWKUPENR register  ********************/
#define PWR_MPUWKUPENR_WKUPEN_Pos      (0U)
#define PWR_MPUWKUPENR_WKUPEN_Msk      (0x3FUL << PWR_MPUWKUPENR_WKUPEN_Pos)    /*!< 0x0000003F */
#define PWR_MPUWKUPENR_WKUPEN          PWR_MPUWKUPENR_WKUPEN_Msk                /*!< Enable Wakeup and interrupt */
#define PWR_MPUWKUPENR_WKUPEN6_Pos     (5U)
#define PWR_MPUWKUPENR_WKUPEN6_Msk     (0x1UL << PWR_MPUWKUPENR_WKUPEN6_Pos)    /*!< 0x00000020 */
#define PWR_MPUWKUPENR_WKUPEN6         PWR_MPUWKUPENR_WKUPEN6_Msk               /*!< Enable Wakeup WKUP6 pin and interrupt */
#define PWR_MPUWKUPENR_WKUPEN5_Pos     (4U)
#define PWR_MPUWKUPENR_WKUPEN5_Msk     (0x1UL << PWR_MPUWKUPENR_WKUPEN5_Pos)    /*!< 0x00000010 */
#define PWR_MPUWKUPENR_WKUPEN5         PWR_MPUWKUPENR_WKUPEN5_Msk               /*!< Enable Wakeup WKUP5 pin and interrupt */
#define PWR_MPUWKUPENR_WKUPEN4_Pos     (3U)
#define PWR_MPUWKUPENR_WKUPEN4_Msk     (0x1UL << PWR_MPUWKUPENR_WKUPEN4_Pos)    /*!< 0x00000008 */
#define PWR_MPUWKUPENR_WKUPEN4         PWR_MPUWKUPENR_WKUPEN4_Msk               /*!< Enable Wakeup WKUP4 pin and interrupt */
#define PWR_MPUWKUPENR_WKUPEN3_Pos     (2U)
#define PWR_MPUWKUPENR_WKUPEN3_Msk     (0x1UL << PWR_MPUWKUPENR_WKUPEN3_Pos)    /*!< 0x00000004 */
#define PWR_MPUWKUPENR_WKUPEN3         PWR_MPUWKUPENR_WKUPEN3_Msk               /*!< Enable Wakeup WKUP3 pin and interrupt */
#define PWR_MPUWKUPENR_WKUPEN2_Pos     (1U)
#define PWR_MPUWKUPENR_WKUPEN2_Msk     (0x1UL << PWR_MPUWKUPENR_WKUPEN2_Pos)    /*!< 0x00000002 */
#define PWR_MPUWKUPENR_WKUPEN2         PWR_MPUWKUPENR_WKUPEN2_Msk               /*!< Enable Wakeup WKUP2 pin and interrupt */
#define PWR_MPUWKUPENR_WKUPEN1_Pos     (0U)
#define PWR_MPUWKUPENR_WKUPEN1_Msk     (0x1UL << PWR_MPUWKUPENR_WKUPEN1_Pos)    /*!< 0x00000001 */
#define PWR_MPUWKUPENR_WKUPEN1         PWR_MPUWKUPENR_WKUPEN1_Msk               /*!< Enable Wakeup WKUP1 pin and interrupt */

