zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131dxx_ca7.h
/********************  Bit definition for HDP_GPOCLR register*********************/
#define HDP_GPOCLR_HDPGPOCLR_Pos    (0U)
#define HDP_GPOCLR_HDPGPOCLR_Msk    (0xFFUL << HDP_GPOCLR_HDPGPOCLR_Pos)        /*!< 0x000000FF */
#define HDP_GPOCLR_HDPGPOCLR        HDP_GPOCLR_HDPGPOCLR_Msk                   /*When a bit is written to 1, the corresponding HDP GPO is cleared*/

/********************  Bit definition for HDP_GPOVAL register*********************/
#define HDP_GPOVAL_HDPGPOVAL_Pos    (0U)
#define HDP_GPOVAL_HDPGPOVAL_Msk    (0xFFUL << HDP_GPOVAL_HDPGPOVAL_Pos)        /*!< 0x000000FF */
#define HDP_GPOVAL_HDPGPOVAL        HDP_GPOVAL_HDPGPOVAL_Msk                   /*When written, define the value of the HDP GPO*/

/********************  Bit definition for HDP_VERR register***********************/
#define HDP_VERR_MINREV_Pos         (0U)
#define HDP_VERR_MINREV_Msk         (0xFUL << HDP_VERR_MINREV_Pos)              /*!< 0x0000000F */
#define HDP_VERR_MINREV             HDP_VERR_MINREV_Msk                        /*Minor Revision of the IP*/
#define HDP_VERR_MAJREV_Pos         (4U)
#define HDP_VERR_MAJREV_Msk         (0xFUL << HDP_VERR_MAJREV_Pos)              /*!< 0x000000F0 */
#define HDP_VERR_MAJREV             HDP_VERR_MAJREV_Msk                        /*Major Revision of the IP*/

/********************  Bit definition for HDP_IPIDR register**********************/
#define HDP_IPIDR_ID_Pos            (0U)
#define HDP_IPIDR_ID_Msk            (0xFFFFFFFFUL << HDP_IPIDR_ID_Pos)          /*!< 0xFFFFFFFF */
#define HDP_IPIDR_ID                HDP_IPIDR_ID_Msk                           /*IP Identifier*/

/********************  Bit definition for HDP_SIDR register**********************/
#define HDP_SIDR_SID_Pos            (0U)
#define HDP_SIDR_SID_Msk            (0xFFFFFFFFUL << HDP_SIDR_SID_Pos)          /*!< 0xFFFFFFFF */
#define HDP_SIDR_SID                HDP_SIDR_SID_Msk                           /*Size Identifier*/


/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/
/*****************  Bit definition for RCC_SECCFGR register  ******************/
#define RCC_SECCFGR_HSISEC_Pos                     (0U)
#define RCC_SECCFGR_HSISEC_Msk                     (0x1UL << RCC_SECCFGR_HSISEC_Pos)                    /*!< 0x00000001 */
#define RCC_SECCFGR_HSISEC                         RCC_SECCFGR_HSISEC_Msk                              /*!< Secure state of the HSI clock */
#define RCC_SECCFGR_CSISEC_Pos                     (1U)
#define RCC_SECCFGR_CSISEC_Msk                     (0x1UL << RCC_SECCFGR_CSISEC_Pos)                    /*!< 0x00000002 */
#define RCC_SECCFGR_CSISEC                         RCC_SECCFGR_CSISEC_Msk                              /*!< Secure state of the CSI clock */
#define RCC_SECCFGR_HSESEC_Pos                     (2U)
#define RCC_SECCFGR_HSESEC_Msk                     (0x1UL << RCC_SECCFGR_HSESEC_Pos)                    /*!< 0x00000004 */
#define RCC_SECCFGR_HSESEC                         RCC_SECCFGR_HSESEC_Msk                              /*!< Secure state of the HSE clock */
#define RCC_SECCFGR_LSISEC_Pos                     (3U)
#define RCC_SECCFGR_LSISEC_Msk                     (0x1UL << RCC_SECCFGR_LSISEC_Pos)                    /*!< 0x00000008 */
#define RCC_SECCFGR_LSISEC                         RCC_SECCFGR_LSISEC_Msk                              /*!< Secure state of the LSI clock */
#define RCC_SECCFGR_LSESEC_Pos                     (4U)
#define RCC_SECCFGR_LSESEC_Msk                     (0x1UL << RCC_SECCFGR_LSESEC_Pos)                    /*!< 0x00000010 */
#define RCC_SECCFGR_LSESEC                         RCC_SECCFGR_LSESEC_Msk                              /*!< Secure state of the LSE clock */
#define RCC_SECCFGR_PLL12SEC_Pos                   (8U)
#define RCC_SECCFGR_PLL12SEC_Msk                   (0x1UL << RCC_SECCFGR_PLL12SEC_Pos)                  /*!< 0x00000100 */
#define RCC_SECCFGR_PLL12SEC                       RCC_SECCFGR_PLL12SEC_Msk                            /*!< Secure state of the PLL1 and PLL2 clocks */
#define RCC_SECCFGR_PLL3SEC_Pos                    (9U)
#define RCC_SECCFGR_PLL3SEC_Msk                    (0x1UL << RCC_SECCFGR_PLL3SEC_Pos)                   /*!< 0x00000200 */
#define RCC_SECCFGR_PLL3SEC                        RCC_SECCFGR_PLL3SEC_Msk                             /*!< Secure state of the PLL3 clock */
#define RCC_SECCFGR_PLL4SEC_Pos                    (10U)
#define RCC_SECCFGR_PLL4SEC_Msk                    (0x1UL << RCC_SECCFGR_PLL4SEC_Pos)                   /*!< 0x00000400 */
#define RCC_SECCFGR_PLL4SEC                        RCC_SECCFGR_PLL4SEC_Msk                             /*!< Secure state of the PLL4 clock */
#define RCC_SECCFGR_MPUSEC_Pos                     (11U)
#define RCC_SECCFGR_MPUSEC_Msk                     (0x1UL << RCC_SECCFGR_MPUSEC_Pos)                    /*!< 0x00000800 */
#define RCC_SECCFGR_MPUSEC                         RCC_SECCFGR_MPUSEC_Msk                              /*!< Secure state of the MPU sub-system clock */
#define RCC_SECCFGR_AXISEC_Pos                     (12U)
#define RCC_SECCFGR_AXISEC_Msk                     (0x1UL << RCC_SECCFGR_AXISEC_Pos)                    /*!< 0x00001000 */
#define RCC_SECCFGR_AXISEC                         RCC_SECCFGR_AXISEC_Msk                              /*!< Secure state of the AXI sub-system clock */
#define RCC_SECCFGR_MLAHBSEC_Pos                   (13U)
#define RCC_SECCFGR_MLAHBSEC_Msk                   (0x1UL << RCC_SECCFGR_MLAHBSEC_Pos)                  /*!< 0x00002000 */
#define RCC_SECCFGR_MLAHBSEC                       RCC_SECCFGR_MLAHBSEC_Msk                            /*!< Secure state of the MLAHB sub-system clock */
#define RCC_SECCFGR_APB3DIVSEC_Pos                 (16U)
#define RCC_SECCFGR_APB3DIVSEC_Msk                 (0x1UL << RCC_SECCFGR_APB3DIVSEC_Pos)                /*!< 0x00010000 */
#define RCC_SECCFGR_APB3DIVSEC                     RCC_SECCFGR_APB3DIVSEC_Msk                          /*!< Secure state of the APB3DIV divider */
#define RCC_SECCFGR_APB4DIVSEC_Pos                 (17U)
#define RCC_SECCFGR_APB4DIVSEC_Msk                 (0x1UL << RCC_SECCFGR_APB4DIVSEC_Pos)                /*!< 0x00020000 */
#define RCC_SECCFGR_APB4DIVSEC                     RCC_SECCFGR_APB4DIVSEC_Msk                          /*!< Secure state of the APB4DIV divider */
#define RCC_SECCFGR_APB5DIVSEC_Pos                 (18U)
#define RCC_SECCFGR_APB5DIVSEC_Msk                 (0x1UL << RCC_SECCFGR_APB5DIVSEC_Pos)                /*!< 0x00040000 */
#define RCC_SECCFGR_APB5DIVSEC                     RCC_SECCFGR_APB5DIVSEC_Msk                          /*!< Secure state of the APB5DIV divider */
#define RCC_SECCFGR_APB6DIVSEC_Pos                 (19U)
#define RCC_SECCFGR_APB6DIVSEC_Msk                 (0x1UL << RCC_SECCFGR_APB6DIVSEC_Pos)                /*!< 0x00080000 */
#define RCC_SECCFGR_APB6DIVSEC                     RCC_SECCFGR_APB6DIVSEC_Msk                          /*!< Secure state of the APB6DIV divider */
#define RCC_SECCFGR_TIMG3SEC_Pos                   (20U)
#define RCC_SECCFGR_TIMG3SEC_Msk                   (0x1UL << RCC_SECCFGR_TIMG3SEC_Pos)                  /*!< 0x00100000 */
#define RCC_SECCFGR_TIMG3SEC                       RCC_SECCFGR_TIMG3SEC_Msk                            /*!< Secure state of the TIMG3 prescaler */
#define RCC_SECCFGR_CPERSEC_Pos                    (21U)
#define RCC_SECCFGR_CPERSEC_Msk                    (0x1UL << RCC_SECCFGR_CPERSEC_Pos)                   /*!< 0x00200000 */
#define RCC_SECCFGR_CPERSEC                        RCC_SECCFGR_CPERSEC_Msk                             /*!< Secure state of the common peripheral clock */
#define RCC_SECCFGR_MCO1SEC_Pos                    (22U)
#define RCC_SECCFGR_MCO1SEC_Msk                    (0x1UL << RCC_SECCFGR_MCO1SEC_Pos)                   /*!< 0x00400000 */
#define RCC_SECCFGR_MCO1SEC                        RCC_SECCFGR_MCO1SEC_Msk                             /*!< Secure state of the MCO1 clock */
#define RCC_SECCFGR_MCO2SEC_Pos                    (23U)
#define RCC_SECCFGR_MCO2SEC_Msk                    (0x1UL << RCC_SECCFGR_MCO2SEC_Pos)                   /*!< 0x00800000 */
#define RCC_SECCFGR_MCO2SEC                        RCC_SECCFGR_MCO2SEC_Msk                             /*!< Secure state of the MCO2 clock */
#define RCC_SECCFGR_STPSEC_Pos                     (24U)
#define RCC_SECCFGR_STPSEC_Msk                     (0x1UL << RCC_SECCFGR_STPSEC_Pos)                    /*!< 0x01000000 */
#define RCC_SECCFGR_STPSEC                         RCC_SECCFGR_STPSEC_Msk                              /*!< Secure state of the Stop modes */
#define RCC_SECCFGR_RSTSEC_Pos                     (25U)
#define RCC_SECCFGR_RSTSEC_Msk                     (0x1UL << RCC_SECCFGR_RSTSEC_Pos)                    /*!< 0x02000000 */
#define RCC_SECCFGR_RSTSEC                         RCC_SECCFGR_RSTSEC_Msk                              /*!< Secure state of the reset */
#define RCC_SECCFGR_PWRSEC_Pos                     (31U)
#define RCC_SECCFGR_PWRSEC_Msk                     (0x1UL << RCC_SECCFGR_PWRSEC_Pos)                    /*!< 0x80000000 */
#define RCC_SECCFGR_PWRSEC                         RCC_SECCFGR_PWRSEC_Msk                              /*!< Secure state of the PWR block This control bit generates the output signal rcc_pwr_sec which is connected to the PWR block. */

/***************  Bit definition for RCC_MP_SREQSETR register  ****************/
#define RCC_MP_SREQSETR_STPREQ_P0_Pos              (0U)
#define RCC_MP_SREQSETR_STPREQ_P0_Msk              (0x1UL << RCC_MP_SREQSETR_STPREQ_P0_Pos)             /*!< 0x00000001 */
#define RCC_MP_SREQSETR_STPREQ_P0                  RCC_MP_SREQSETR_STPREQ_P0_Msk                       /*!< Stop request from MPU processor Set by software Indicates if the MPU processor allow or not the entry in CStop/CStandby modes for MPU domain, when the MPU is in WFI. Note: the entry selection between CStop and CStandby is controlled by PWR_MPUCR.PDDS and PWR_CR1.STOP2 control bits. */

/***************  Bit definition for RCC_MP_SREQCLRR register  ****************/
#define RCC_MP_SREQCLRR_STPREQ_P0_Pos              (0U)
#define RCC_MP_SREQCLRR_STPREQ_P0_Msk              (0x1UL << RCC_MP_SREQCLRR_STPREQ_P0_Pos)             /*!< 0x00000001 */
#define RCC_MP_SREQCLRR_STPREQ_P0                  RCC_MP_SREQCLRR_STPREQ_P0_Msk                       /*!< Stop request from MPU processor Cleared by software Indicates if the MPU processor allow or not the entry in CStop/CStandby modes for MPU domain, when the MPU is in WFI. Note: the entry selection between CStop and CStandby is controlled by PWR_MPUCR.PDDS and PWR_CR1.STOP2 control bits. */

/****************  Bit definition for RCC_MP_APRSTCR register  ****************/
#define RCC_MP_APRSTCR_RDCTLEN_Pos                 (0U)
#define RCC_MP_APRSTCR_RDCTLEN_Msk                 (0x1UL << RCC_MP_APRSTCR_RDCTLEN_Pos)                /*!< 0x00000001 */
#define RCC_MP_APRSTCR_RDCTLEN                     RCC_MP_APRSTCR_RDCTLEN_Msk                          /*!< Reset delay control enable Set and reset by software. */
#define RCC_MP_APRSTCR_RSTTO_Pos                   (8U)
#define RCC_MP_APRSTCR_RSTTO_Msk                   (0x7FUL << RCC_MP_APRSTCR_RSTTO_Pos)                 /*!< 0x00007F00 */
#define RCC_MP_APRSTCR_RSTTO                       RCC_MP_APRSTCR_RSTTO_Msk                            /*!< Reset timeout delay adjust Written by software in order to define the maximum amount of time the app_rst is delayed. The timeout value is counted using hsi_ck, which can be divided according to HSIDIV. This function is only available when the RDCTLEN = '1'. It is not allowed to change this field value when RDCTLEN = '1â. Refer to Delay Control (RDCTL) for additional information of the programming of the timeout value. ... */
#define RCC_MP_APRSTCR_RSTTO_0                     (0x1UL << RCC_MP_APRSTCR_RSTTO_Pos)                /*!< 0x00000100 */
#define RCC_MP_APRSTCR_RSTTO_1                     (0x2UL << RCC_MP_APRSTCR_RSTTO_Pos)                /*!< 0x00000200 */
#define RCC_MP_APRSTCR_RSTTO_2                     (0x4UL << RCC_MP_APRSTCR_RSTTO_Pos)                /*!< 0x00000400 */
#define RCC_MP_APRSTCR_RSTTO_3                     (0x8UL << RCC_MP_APRSTCR_RSTTO_Pos)                /*!< 0x00000800 */
#define RCC_MP_APRSTCR_RSTTO_4                     (0x10UL << RCC_MP_APRSTCR_RSTTO_Pos)               /*!< 0x00001000 */
#define RCC_MP_APRSTCR_RSTTO_5                     (0x20UL << RCC_MP_APRSTCR_RSTTO_Pos)               /*!< 0x00002000 */
#define RCC_MP_APRSTCR_RSTTO_6                     (0x40UL << RCC_MP_APRSTCR_RSTTO_Pos)               /*!< 0x00004000 */

/****************  Bit definition for RCC_MP_APRSTSR register  ****************/
#define RCC_MP_APRSTSR_RSTTOV_Pos                  (8U)
#define RCC_MP_APRSTSR_RSTTOV_Msk                  (0x7FUL << RCC_MP_APRSTSR_RSTTOV_Pos)                /*!< 0x00007F00 */
#define RCC_MP_APRSTSR_RSTTOV                      RCC_MP_APRSTSR_RSTTOV_Msk                           /*!< Reset timeout delay value Set by hardware in order to give the value of the timeout counter. This function is only available when the RDCTLEN = '1'. If RSTTOS = '0' it means that a timeout occurred. */
#define RCC_MP_APRSTSR_RSTTOV_0                    (0x1UL << RCC_MP_APRSTSR_RSTTOV_Pos)               /*!< 0x00000100 */
#define RCC_MP_APRSTSR_RSTTOV_1                    (0x2UL << RCC_MP_APRSTSR_RSTTOV_Pos)               /*!< 0x00000200 */
#define RCC_MP_APRSTSR_RSTTOV_2                    (0x4UL << RCC_MP_APRSTSR_RSTTOV_Pos)               /*!< 0x00000400 */
#define RCC_MP_APRSTSR_RSTTOV_3                    (0x8UL << RCC_MP_APRSTSR_RSTTOV_Pos)               /*!< 0x00000800 */
#define RCC_MP_APRSTSR_RSTTOV_4                    (0x10UL << RCC_MP_APRSTSR_RSTTOV_Pos)              /*!< 0x00001000 */
#define RCC_MP_APRSTSR_RSTTOV_5                    (0x20UL << RCC_MP_APRSTSR_RSTTOV_Pos)              /*!< 0x00002000 */
#define RCC_MP_APRSTSR_RSTTOV_6                    (0x40UL << RCC_MP_APRSTSR_RSTTOV_Pos)              /*!< 0x00004000 */

/****************  Bit definition for RCC_PWRLPDLYCR register  ****************/
#define RCC_PWRLPDLYCR_PWRLP_DLY_Pos               (0U)
#define RCC_PWRLPDLYCR_PWRLP_DLY_Msk               (0x3FFFFFUL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)         /*!< 0x003FFFFF */
#define RCC_PWRLPDLYCR_PWRLP_DLY                   RCC_PWRLPDLYCR_PWRLP_DLY_Msk                        /*!< PWRLP_TEMPO value Written by software. This register contains the delay value to be observed before activating the PLLs and interconnect clocks, after one of the system Stop modes. The delay is counted with the HSI clock. The user has to take into account HSIDIV value. The delay value is given by the following formula: PWRLP_DLY[21:0] / FHSI ... */
#define RCC_PWRLPDLYCR_PWRLP_DLY_0                 (0x1UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)              /*!< 0x00000001 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_1                 (0x2UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)              /*!< 0x00000002 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_2                 (0x4UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)              /*!< 0x00000004 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_3                 (0x8UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)              /*!< 0x00000008 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_4                 (0x10UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)             /*!< 0x00000010 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_5                 (0x20UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)             /*!< 0x00000020 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_6                 (0x40UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)             /*!< 0x00000040 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_7                 (0x80UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)             /*!< 0x00000080 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_8                 (0x100UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)            /*!< 0x00000100 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_9                 (0x200UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)            /*!< 0x00000200 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_10                (0x400UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)            /*!< 0x00000400 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_11                (0x800UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)            /*!< 0x00000800 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_12                (0x1000UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)           /*!< 0x00001000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_13                (0x2000UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)           /*!< 0x00002000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_14                (0x4000UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)           /*!< 0x00004000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_15                (0x8000UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)           /*!< 0x00008000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_16                (0x10000UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)          /*!< 0x00010000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_17                (0x20000UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)          /*!< 0x00020000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_18                (0x40000UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)          /*!< 0x00040000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_19                (0x80000UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)          /*!< 0x00080000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_20                (0x100000UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)         /*!< 0x00100000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_21                (0x200000UL << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)         /*!< 0x00200000 */

/***************  Bit definition for RCC_MP_GRSTCSETR register  ***************/
#define RCC_MP_GRSTCSETR_MPSYSRST_Pos              (0U)
#define RCC_MP_GRSTCSETR_MPSYSRST_Msk              (0x1UL << RCC_MP_GRSTCSETR_MPSYSRST_Pos)             /*!< 0x00000001 */
#define RCC_MP_GRSTCSETR_MPSYSRST                  RCC_MP_GRSTCSETR_MPSYSRST_Msk                       /*!< System reset Set by software, cleared by hardware. */
#define RCC_MP_GRSTCSETR_MPUP0RST_Pos              (4U)
#define RCC_MP_GRSTCSETR_MPUP0RST_Msk              (0x1UL << RCC_MP_GRSTCSETR_MPUP0RST_Pos)             /*!< 0x00000010 */
#define RCC_MP_GRSTCSETR_MPUP0RST                  RCC_MP_GRSTCSETR_MPUP0RST_Msk                       /*!< MPU processor reset Set by software, cleared by hardware when the reset command is completed. Note that the Snoop Control Unit of the MPU (SCU) is not reset. */

/***************  Bit definition for RCC_BR_RSTSCLRR register  ****************/
#define RCC_BR_RSTSCLRR_PORRSTF_Pos                (0U)
#define RCC_BR_RSTSCLRR_PORRSTF_Msk                (0x1UL << RCC_BR_RSTSCLRR_PORRSTF_Pos)               /*!< 0x00000001 */
#define RCC_BR_RSTSCLRR_PORRSTF                    RCC_BR_RSTSCLRR_PORRSTF_Msk                         /*!< POR/PDR reset flag Cleared by software, set by hardware when a POR/PDR reset occurred. */
#define RCC_BR_RSTSCLRR_BORRSTF_Pos                (1U)
#define RCC_BR_RSTSCLRR_BORRSTF_Msk                (0x1UL << RCC_BR_RSTSCLRR_BORRSTF_Pos)               /*!< 0x00000002 */
#define RCC_BR_RSTSCLRR_BORRSTF                    RCC_BR_RSTSCLRR_BORRSTF_Msk                         /*!< BOR reset flag Cleared by software, set by hardware when a BOR reset occurred. */
#define RCC_BR_RSTSCLRR_PADRSTF_Pos                (2U)
#define RCC_BR_RSTSCLRR_PADRSTF_Msk                (0x1UL << RCC_BR_RSTSCLRR_PADRSTF_Pos)               /*!< 0x00000004 */
#define RCC_BR_RSTSCLRR_PADRSTF                    RCC_BR_RSTSCLRR_PADRSTF_Msk                         /*!< NRST reset flag Cleared by software, set by hardware when a PAD reset occurred. */
#define RCC_BR_RSTSCLRR_HCSSRSTF_Pos               (3U)
#define RCC_BR_RSTSCLRR_HCSSRSTF_Msk               (0x1UL << RCC_BR_RSTSCLRR_HCSSRSTF_Pos)              /*!< 0x00000008 */
#define RCC_BR_RSTSCLRR_HCSSRSTF                   RCC_BR_RSTSCLRR_HCSSRSTF_Msk                        /*!< HSE CSS reset flag Cleared by software, set by hardware when a failure is detected on HSE. */
#define RCC_BR_RSTSCLRR_VCORERSTF_Pos              (4U)
#define RCC_BR_RSTSCLRR_VCORERSTF_Msk              (0x1UL << RCC_BR_RSTSCLRR_VCORERSTF_Pos)             /*!< 0x00000010 */
#define RCC_BR_RSTSCLRR_VCORERSTF                  RCC_BR_RSTSCLRR_VCORERSTF_Msk                       /*!< VDDCORE reset flag Cleared by software, set by hardware when a reset occurred because VDDCORE is lower than the expected value. */
#define RCC_BR_RSTSCLRR_VCPURSTF_Pos               (5U)
#define RCC_BR_RSTSCLRR_VCPURSTF_Msk               (0x1UL << RCC_BR_RSTSCLRR_VCPURSTF_Pos)              /*!< 0x00000020 */
#define RCC_BR_RSTSCLRR_VCPURSTF                   RCC_BR_RSTSCLRR_VCPURSTF_Msk                        /*!< VDDCPU reset flag Cleared by software, set by hardware when a reset occurred because VDDCPU is lower than the expected value. */
#define RCC_BR_RSTSCLRR_MPSYSRSTF_Pos              (6U)
#define RCC_BR_RSTSCLRR_MPSYSRSTF_Msk              (0x1UL << RCC_BR_RSTSCLRR_MPSYSRSTF_Pos)             /*!< 0x00000040 */
#define RCC_BR_RSTSCLRR_MPSYSRSTF                  RCC_BR_RSTSCLRR_MPSYSRSTF_Msk                       /*!< MPU System reset flag Cleared by software, set by hardware when a MPU system reset occurred. */
#define RCC_BR_RSTSCLRR_IWDG1RSTF_Pos              (8U)
#define RCC_BR_RSTSCLRR_IWDG1RSTF_Msk              (0x1UL << RCC_BR_RSTSCLRR_IWDG1RSTF_Pos)             /*!< 0x00000100 */
#define RCC_BR_RSTSCLRR_IWDG1RSTF                  RCC_BR_RSTSCLRR_IWDG1RSTF_Msk                       /*!< IWDG1 reset flag Cleared by software, set by hardware when a IWDG1 reset occurred. */
#define RCC_BR_RSTSCLRR_IWDG2RSTF_Pos              (9U)
#define RCC_BR_RSTSCLRR_IWDG2RSTF_Msk              (0x1UL << RCC_BR_RSTSCLRR_IWDG2RSTF_Pos)             /*!< 0x00000200 */
#define RCC_BR_RSTSCLRR_IWDG2RSTF                  RCC_BR_RSTSCLRR_IWDG2RSTF_Msk                       /*!< IWDG2 reset flag Cleared by software, set by hardware when a IWDG2 reset occurred. */
#define RCC_BR_RSTSCLRR_MPUP0RSTF_Pos              (13U)
#define RCC_BR_RSTSCLRR_MPUP0RSTF_Msk              (0x1UL << RCC_BR_RSTSCLRR_MPUP0RSTF_Pos)             /*!< 0x00002000 */
#define RCC_BR_RSTSCLRR_MPUP0RSTF                  RCC_BR_RSTSCLRR_MPUP0RSTF_Msk                       /*!< MPU processor reset flag Cleared by software, set by hardware when a MPU processor reset occurred. */

